/* globalvar_test.c源文件 */

/*********************************************************** 
 * 功能:	全局变量测试
 **********************************************************/
char g_char  	= 'a';
short g_short 	= 123;
int  g_int 	 	= 123456;
char g_str1[] = "SC语言及SCC编译器会成为风靡全球的编译原理最佳教学用例吗？\n";
char *g_str2  = "也许会吧！\n";
void global_var_test()
{
	printf("g_char='%c', g_short = %d, g_int = %d\n", 
	        g_char,g_short,g_int);
	printf(g_str1);
	printf(g_str2);
}

/*********************************************************** 
 * 功能:	main函数
 **********************************************************/
int  main()
{
	global_var_test();	
	return 0;
}

/*********************************************************** 
 * 功能:	入口函数
 **********************************************************/
void  _entry()
{
	int ret;
	ret = main();
	exit(ret);
}